01  WS-AREA-1 PIC 9(5) VALUE 0.
01  WS-AREA-2 PIC 9(5) VALUE 0.
01 WS-AREA-RESULT PIC S9(9) VALUE 0. 
PROCEDURE DIVISION.
    ADD 1 TO WS-AREA-1.
    SUBTRACT 1 FROM WS-AREA-2.
    SUBTRACT WS-AREA-2 FROM WS-AREA-1 GIVING WS-AREA-RESULT. 
    IF WS-AREA-RESULT > 0 THEN
        DISPLAY "WS-AREA-1 is greater than WS-AREA-2"
    ELSE
        DISPLAY "WS-AREA-1 is not greater than WS-AREA-2"
    END-IF.
    STOP RUN.